In [1]:
import pandas as pd
import re
import numpy as np

# PUNTO 1: For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

In [2]:
times_data=pd.read_csv("Downloads/2020/timesData.csv")
times_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

In [3]:
times_data['wrank_M']=times_data['world_rank'].str.extract(r'([0-9]*$)')
times_data['wrank_m']=times_data['world_rank'].str.extract(r'([0-9]+)')
times_data['wrank_M']=np.array(times_data['wrank_M'],dtype=int)
times_data['wrank_m']=np.array(times_data['wrank_m'],dtype=int)

In [4]:
mr_data=times_data.iloc[times_data.groupby('university_name')['year'].idxmax()]
mr_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,wrank_M,wrank_m
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,800,601
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,250,201
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,300,251
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,106,106
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,350,301

In [5]:
lr_data=times_data.iloc[times_data.groupby('university_name')['year'].idxmin()]
lr_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,wrank_M,wrank_m
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,800,601
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012,350,301
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012,350,301
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011,167,167
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012,300,276

# PUNTO 2:  For each university, compute the improvement in income between the least recent and the most recent data points

In [6]:
a=mr_data['income']
b=lr_data['income']
counts=[]
for (i,j) in list(zip(a,b)):
    if i=='-' or j=='-':
        counts.append(None)
    else:
        counts.append(float(i)-float(j))
dati={'university_name':mr_data['university_name'],'increase':counts}
pd.DataFrame(dati)

                               university_name  increase
2405  AGH University of Science and Technology       NaN
2003                        Aalborg University       7.3
2056                          Aalto University      -0.3
1908                         Aarhus University       6.8
2105                    Aberystwyth University      -4.2
...                                        ...       ...
1856                  École Normale Supérieure       6.4
2013          École Normale Supérieure de Lyon       5.6
1904                       École Polytechnique       NaN
1833  École Polytechnique Fédérale de Lausanne      27.4
2134                         Örebro University       0.0

[818 rows x 2 columns]

# PUNTO 3: Find the university with the largest increase computed in the previous point

In [7]:
pd.DataFrame(dati)[pd.DataFrame(dati)['increase']==pd.DataFrame(dati)['increase'].max()]['university_name']

1960    TU Dresden
Name: university_name, dtype: object

# PUNTO 4: For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

In [8]:
cwurData=pd.read_csv("Downloads/2020/cwurData.csv")
cwur_data=cwurData.iloc[cwurData.groupby('institution')['year'].idxmax()]

In [9]:
shanghaiData=pd.read_csv('Downloads/2020/shanghaiData.csv')
shanghaiData['wrank_M']=shanghaiData['world_rank'].str.extract(r'([0-9]*$)')
shanghaiData['wrank_m']=shanghaiData['world_rank'].str.extract(r'([0-9]+)')
shanghaiData['wrank_M']=np.array(shanghaiData['wrank_M'],dtype=int)
shanghaiData['wrank_m']=np.array(shanghaiData['wrank_m'],dtype=int)
shan_data=shanghaiData.iloc[shanghaiData.groupby('university_name')['year'].idxmax()]

In [10]:
fuso=pd.merge(shan_data,mr_data,on='university_name',how='outer')
fuso1=pd.merge(fuso,cwur_data,left_on='university_name',right_on='institution',how='outer')
fuso[['university_name','world_rank_x','world_rank_y']]
fuso1[['institution','world_rank','wrank_M_x','wrank_m_x','wrank_M_y','wrank_m_y']]
fuso2=pd.DataFrame(fuso1[['institution','world_rank','wrank_M_x','wrank_m_x','wrank_M_y','wrank_m_y']])
fuso2.head()

,institution,world_rank,wrank_M_x,wrank_m_x,wrank_M_y,wrank_m_y
0,Aalborg University,565.0,400.0,301.0,250.0,201.0
1,Aalto University,421.0,500.0,401.0,300.0,251.0
2,Aarhus University,122.0,73.0,73.0,106.0,106.0
3,NaN,NaN,150.0,101.0,NaN,NaN
4,Aix-Marseille University,206.0,150.0,102.0,300.0,251.0

In [73]:
fuso1[(fuso1['world_rank'].notnull())&(fuso1['wrank_M_x'].notnull())&(fuso1['wrank_M_y'].notnull())&(fuso1['wrank_m_x'].notnull())&(fuso1['wrank_m_y'].notnull())].shape

(362, 43)

In [74]:
fuso2['diff1']=abs(fuso2['world_rank']-fuso2['wrank_m_x'])
fuso2['diff2']=abs(fuso2['world_rank']-fuso2['wrank_m_y'])
fuso2['diff3']=abs(fuso2['wrank_M_x']-fuso2['wrank_m_y'])
fuso2['diff4']=abs(fuso2['wrank_M_y']-fuso2['wrank_m_x'])
fuso2['diff5']=abs(fuso2['wrank_m_x']-fuso2['wrank_M_x'])
fuso3=fuso2[['institution','diff1','diff2','diff3','diff4','diff5']]
def calcolaMaxDiff(row):
    return max(row[1],row[2],row[3],row[4],row[5])
fuso3.apply(calcolaMaxDiff,axis=1)
a1=fuso1['institution']
b1=fuso1['university_name']
total_universities=[]
for (i,j) in list(zip(a1,b1)):
    if pd.notnull(i):
        total_universities.append(i)
    if pd.isnull(i) and pd.notnull(j):
        total_universities.append(j)
diz={}
for (i,j) in zip(total_universities,fuso3.apply(calcolaMaxDiff,axis=1)):
    diz[i]=j
diz

{'Aalborg University': 364.0,
 'Aalto University': 249.0,
 'Aarhus University': 49.0,
 'Aix Marseille University': nan,
 'Aix-Marseille University': 198.0,
 'Aristotle University of Thessaloniki': 399.0,
 'Arizona State University': 96.0,
 'Arizona State University - Tempe': nan,
 'Auburn University': 199.0,
 'Autonomous University of Barcelona': 154.0,
 'Autonomous University of Madrid': 149.0,
 'Bangor University': 267.0,
 'Bar-Ilan University': 120.0,
 'Baylor College of Medicine': 49.0,
 'Beihang University': 404.0,
 'Beijing Normal University': 195.0,
 'Beijing University of Aeronautics and Astronautics': nan,
 'Ben-Gurion University of the Negev': 199.0,
 'Bielefeld University': 249.0,
 'Birkbeck, University of London': 497.0,
 'Boston College': 310.0,
 'Boston University': 9.0,
 'Brandeis University': 115.0,
 'Brigham Young University': 102.0,
 'Brown University': 32.0,
 'Brunel University': 99.0,
 'Cairo University': 399.0,
 'California Institute of Technology': 11.0,
 'Capital Medical University': 399.0,
 'Capital University of Medical Sciences': nan,
 'Cardiff University': 50.0,
 'Carleton University': 199.0,
 'Carnegie Mellon University': 39.0,
 'Case Western Reserve University': 49.0,
 'Catholic University of Chile': nan,
 'Catholic University of Korea': 110.0,
 'Catholic University of Leuven': nan,
 'Catholic University of Louvain': nan,
 'Catholic University of the Sacred Heart': 99.0,
 'Central South University': 137.0,
 'Chalmers University of Technology': 201.0,
 'Chang Gung University': 399.0,
 'Charles University in Prague': 299.0,
 'Chiba University': 499.0,
 'China Agricultural University': 326.0,
 'China Medical University': nan,
 'Chungnam National University': 399.0,
 'City University of Hong Kong': 172.0,
 'City University of New York City College': nan,
 'Claude Bernard University Lyon 1': 299.0,
 'Clemson University': 399.0,
 'College of France': nan,
 'Colorado State University': nan,
 'Columbia University': 9.0,
 'Complutense University of Madrid': 299.0,
 'Concordia University': 99.0,
 'Cornell University': 8.0,
 'Cranfield University': 192.0,
 'Curtin University': 394.0,
 'Curtin University of Technology': nan,
 'Dalhousie University': 99.0,
 'Dalian University of Technology': 499.0,
 'Dartmouth College': 196.0,
 'Deakin University': 278.0,
 'Delft University of Technology': 235.0,
 'Dresden University of Technology': 99.0,
 'Drexel University': 99.0,
 'Duke University': 11.0,
 'Durham University': 230.0,
 'ESPCI ParisTech': nan,
 'East China University of Science and Technology': 99.0,
 'Ecole National Superieure Mines - Paris': nan,
 'Ecole Normale Superieure - Lyon': nan,
 'Ecole Normale Superieure - Paris': nan,
 'Ecole Polytechnique': nan,
 'Ehime University': 398.0,
 'Eindhoven University of Technology': 224.0,
 'Emory University': 60.0,
 'Eotvos Lorand University': nan,
 'Erasmus University': nan,
 'Ewha Womans University': 99.0,
 'Federal University of Minas Gerais': 399.0,
 'Federal University of Rio Grande do Sul': 399.0,
 'Federal University of Rio de Janeiro': 299.0,
 'Federal University of Sao Paulo': nan,
 'Flinders University': 369.0,
 'Florida International University': 204.0,
 'Florida State University': 99.0,
 'Fudan University': 99.0,
 'George Mason University': 263.0,
 'Georgetown University': 306.0,
 'Georgia Institute of Technology': 109.0,
 'Ghent University': 48.0,
 'Gifu University': 398.0,
 'Griffith University': 362.0,
 'Gunma University': 207.0,
 'Hacettepe University': 399.0,
 'Hannover Medical School': 99.0,
 'Hanyang University': 159.0,
 'Harbin Institute of Technology': 399.0,
 'Harvard University': 5.0,
 'Heidelberg University': nan,
 'Henri Poincare University (Nancy 1)': nan,
 'Hiroshima University': 211.0,
 'Hokkaido University': 349.0,
 'Howard University': 318.0,
 'Huazhong University of Science and Technology': 399.0,
 'Icahn School of Medicine at Mount Sinai': 49.0,
 'Indian Institute of Science': 197.0,
 'Indian Institute of Technology Kharagpur': 213.0,
 'Indiana University Bloomington': nan,
 'Indiana University-Purdue University at Indianapolis': nan,
 'Industrial Physics and Chemistry Higher Educational Institution - Paris': nan,
 'International School for Advanced Studies': 173.0,
 'Iowa State University': 149.0,
 'Istanbul University': 399.0,
 'Jagiellonian University': 499.0,
 'James Cook University': 290.0,
 'Jilin University': 599.0,
 'Johns Hopkins University': 5.0,
 'Joseph Fourier University (Grenoble 1)': nan,
 'Juntendo University': 397.0,
 'KTH Royal Institute of Technology': nan,
 'KU Leuven': nan,
 'Kagoshima University': 217.0,
 'Kanazawa University': 199.0,
 'Kansas State University': 199.0,
 'Karlsruhe Institute of Technology (KIT)': nan,
 'Karolinska Institute': 43.0,
 'Keio University': 467.0,
 'Kent State University': 199.0,
 'King Abdulaziz University': 844.0,
 'King Abdullah University of Science and Technology': 403.0,
 'King Fahd University of Petroleum & Minerals': nan,
 'King Saud University': 449.0,
 "King's College London": 39.0,
 'Kobe University': 499.0,
 'Korea Advanced Institute of Science and Technology': nan,
 'Korea University': 136.0,
 'Kumamoto University': 398.0,
 'Kyoto University': 71.0,
 'Kyung Hee University': 199.0,
 'Kyungpook National University': 399.0,
 'Kyushu University': 301.0,
 'La Trobe University': 294.0,
 'Lancaster University': 296.0,
 'Lanzhou University': 213.0,
 'Laval University': 99.0,
 'Lehigh University': 137.0,
 'Leiden University': 41.0,
 'Linkoping University': nan,
 'London School of Economics and Political Science': nan,
 'London School of Hygiene & Tropical Medicine': 99.0,
 'London School of Hygiene and Tropical Medicine': nan,
 'Loughborough University': 343.0,
 'Louisiana State University - Baton Rouge': 131.0,
 'Louisiana State University Health Sciences Center': nan,
 'Loyola University Chicago': 99.0,
 'Lund University': 60.0,
 'MINES ParisTech': nan,
 'Maastricht University': 212.0,
 'Macquarie University': 248.0,
 'Massachusetts Institute of Technology (MIT)': nan,
 'Massey University': 257.0,
 'Mayo Medical School': nan,
 'McGill University': 26.0,
 'McMaster University': 56.0,
 'Medical College of Georgia': nan,
 'Medical College of Wisconsin': 199.0,
 'Medical University of Graz': 173.0,
 'Medical University of Innsbruck': nan,
 'Medical University of South Carolina': 311.0,
 'Medical University of Vienna': 99.0,
 'Memorial University of Newfoundland': 210.0,
 'Michigan State University': 19.0,
 'Michigan Technological University': 440.0,
 'Mississippi State University': 205.0,
 'Monash University': 77.0,
 'Montana State University - Bozeman': 155.0,
 'Moscow State University': nan,
 'Mount Sinai School of Medicine': nan,
 'Murdoch University': 428.0,
 'Nagasaki University': 399.0,
 'Nagoya University': 273.0,
 'Nanjing Medical University': 485.0,
 'Nanjing University': 99.0,
 'Nankai University': 99.0,
 'Nanyang Technological University': 145.0,
 'Nara Institute of Science and Technology': 146.0,
 'National Autonomous University of Mexico': 299.0,
 'National Central University': 199.0,
 'National Cheng Kung University': 199.0,
 'National Chiao Tung University': 99.0,
 'National Sun Yat-Sen University': nan,
 'National Taiwan University': 110.0,
 'National Tsing Hua University': 206.0,
 'National University of Singapore': 124.0,
 'National Yang Ming University': nan,
 'National and Kapodistrian University of Athens': 199.0,
 'New Jersey Institute of Technology': 360.0,
 'New Mexico State University': 198.0,
 'New York University': 12.0,
 'Newcastle University': 104.0,
 'Nihon University': 99.0,
 'Niigata University': 399.0,
 'North Carolina State University - Raleigh': nan,
 'Northeastern University': 99.0,
 'Northern Arizona University': 365.0,
 'Northwestern University': 5.0,
 'Norwegian University of Science and Technology': 199.0,
 'Norwegian University of Science and Technology - NTNU': nan,
 'Ohio University': 399.0,
 'Okayama University': 399.0,
 'Oklahoma State University': nan,
 'Old Dominion University': 305.0,
 'Oregon Health and Science University': nan,
 'Oregon State University': 149.0,
 'Osaka City University': 199.0,
 'Osaka Prefecture University': 399.0,
 'Osaka University': 215.0,
 'Paris Dauphine University (Paris 9)': nan,
 'Paul Sabatier University (Toulouse 3)': nan,
 'Peking Union Medical College': 99.0,
 'Peking University': 108.0,
 'Pennsylvania State University - University Park': nan,
 'Pierre and Marie  Curie University - Paris 6': nan,
 'Pohang University of Science and Technology': 284.0,
 'Polytechnic Institute of Milan': nan,
 'Polytechnic University of Catalonia': 99.0,
 'Polytechnic University of Turin': 302.0,
 'Polytechnic University of Valencia': 499.0,
 'Pompeu Fabra University': 211.0,
 'Portland State University': 260.0,
 'Princeton University': 3.0,
 'Purdue University - West Lafayette': nan,
 'Pusan National University': 199.0,
 'Queen Mary University of London': 111.0,
 'Queen Mary, U. of London': nan,
 'Queen Mary, University of London': nan,
 "Queen's University": 99.0,
 "Queen's University Belfast": 99.0,
 'Queensland University of Technology': 370.0,
 'RWTH Aachen University': 190.0,
 'Radboud University Nijmegen': 49.0,
 'Rensselaer Polytechnic Institute': 149.0,
 'Rice University': 36.0,
 'Rockefeller University': 4.0,
 'Royal Holloway, U. of London': nan,
 'Royal Institute of Technology': 99.0,
 'Rush University': 299.0,
 'Rutgers, The State University of New Jersey': nan,
 'Rutgers, The State University of New Jersey - New Brunswick': nan,
 'SUNY at Albany': nan,
 'Saarland University': 107.0,
 'Saint Louis University': 249.0,
 'Saint Petersburg State University': 199.0,
 'San Diego State University': 99.0,
 'Sao Paulo State University': nan,
 'Sapienza University of Rome': 99.0,
 'Scuola Normale Superiore - Pisa': nan,
 'Seoul National University': 77.0,
 'Shandong University': 112.0,
 'Shanghai Jiao Tong University': 249.0,
 'Sharif University of Technology': 296.0,
 'Sichuan University': 499.0,
 'Simon Fraser University': 161.0,
 'Soochow University': nan,
 'South China University of Technology': 299.0,
 'Southeast University': 142.0,
 'Southern Methodist University': 260.0,
 'Stanford University': 1.0,
 'State University of Campinas': nan,
 'State University of New York Health Science Center at Brooklyn': nan,
 'State University of New York at Albany': nan,
 'State University of New York at Buffalo': nan,
 'State University of New York at Stony Brook': nan,
 'Stellenbosch University': 199.0,
 'Stockholm School of Economics': nan,
 'Stockholm University': 91.0,
 'Stony Brook University': 99.0,
 'Sun Yat-sen University': 249.0,
 'Sungkyunkwan University': 99.0,
 'Swansea Univ': nan,
 'Swedish University of Agricultural Sciences': 215.0,
 'Swinburne University of Technology': 387.0,
 'Swiss Federal Institute of Technology Lausanne': nan,
 'Swiss Federal Institute of Technology Zurich': nan,
 'Swiss Federal Institute of Technology of Lausanne': nan,
 'Syracuse University': 249.0,
 'TU Dresden': nan,
 'Technical University Darmstadt': nan,
 'Technical University Munich': nan,
 'Technical University of Berlin': 174.0,
 'Technical University of Braunschweig': nan,
 'Technical University of Denmark': 73.0,
 'Technion-Israel Institute of Technology': nan,
 'Tel Aviv University': 115.0,
 'Temple University': 99.0,
 'Texas A & M University': nan,
 'Texas A&M University': nan,
 'Texas A&M University - College Station': nan,
 'Texas Tech University': nan,
 'The Australian National University': nan,
 'The Chinese University of Hong Kong': nan,
 'The College of  William and Mary': nan,
 'The George Washington University': nan,
 'The Graduate University for Advanced Studies': nan,
 'The Hebrew University of Jerusalem': nan,
 'The Hong Kong Polytechnic University': nan,
 'The Hong Kong University of Science and Technology': nan,
 'The Imperial College of Science, Technology and Medicine': nan,
 'The Johns Hopkins University': nan,
 'The Ohio State University - Columbus': nan,
 'The Open University': nan,
 'The Royal Veterinary and Agricultural University': nan,
 'The University of Adelaide': nan,
 'The University of Akron': nan,
 'The University of Alabama at Birmingham': nan,
 'The University of Auckland': nan,
 'The University of Calgary': nan,
 'The University of Connecticut - Storrs': nan,
 'The University of Connecticut Health Center': nan,
 'The University of Dundee': nan,
 'The University of Edinburgh': nan,
 'The University of Georgia': nan,
 'The University of Glasgow': nan,
 'The University of Hong Kong': nan,
 'The University of Manchester': nan,
 'The University of Melbourne': nan,
 'The University of Memphis': nan,
 'The University of Montana - Missoula': nan,
 'The University of New Mexico - Albuquerque': nan,
 'The University of New South Wales': nan,
 'The University of Newcastle, Australia': nan,
 'The University of Queensland': nan,
 'The University of Reading': nan,
 'The University of Sheffield': nan,
 'The University of Texas Health Science Center at Houston': nan,
 'The University of Texas Health Science Center at San Antonio': nan,
 'The University of Texas M. D. Anderson Cancer Center': nan,
 'The University of Texas Medical Branch at Galveston': nan,
 'The University of Texas Southwestern Medical Center at Dallas': nan,
 'The University of Texas at Austin': nan,
 'The University of Texas at Dallas': nan,
 'The University of Texas at San Antonio': nan,
 'The University of Tokushima': nan,
 'The University of Tokyo': nan,
 'The University of Western Australia': nan,
 'Thomas Jefferson University': 99.0,
 'Tianjin University': 299.0,
 'Tilburg University': 488.0,
 'Tohoku University': 149.0,
 'Tokyo Institute of Technology': 99.0,
 'Tokyo Medical and Dental University': 99.0,
 'Tokyo Metropolitan University': 102.0,
 'Tokyo University of Agriculture and Technology': 223.0,
 'Tokyo University of Science': 399.0,
 'Tongji University': 299.0,
 'Toulouse School of Economics': nan,
 'Trinity College Dublin': nan,
 'Tsinghua University': 103.0,
 'Tufts University': 49.0,
 'Tulane University': 149.0,
 'UNESP': nan,
 'Umea University': nan,
 'University College Cork': 149.0,
 'University College Dublin': 224.0,
 'University College London': 13.0,
 'University Libre Bruxelles': nan,
 'University Paris Diderot - Paris 7': nan,
 'University at Albany (State University of New York)': nan,
 'University at Buffalo, the State University of New York': nan,
 'University of Aberdeen': 128.0,
 'University of Alabama at Birmingham': 99.0,
 'University of Alaska - Fairbanks': nan,
 'University of Alberta': 49.0,
 'University of Amsterdam': 92.0,
 'University of Antwerp': 210.0,
 'University of Arizona': 95.0,
 'University of Arkansas at Fayetteville': nan,
 'University of Arkansas at Little Rock': nan,
 'University of Auvergne': nan,
 'University of Barcelona': 58.0,
 'University of Bari': nan,
 'University of Basel': 73.0,
 'University of Bath': 249.0,
 'University of Bayreuth': 119.0,
 'University of Belgrade': 499.0,
 'University of Bergen': 118.0,
 'University of Bern': 80.0,
 'University of Bielefeld': nan,
 'University of Birmingham': 51.0,
 'University of Bochum': nan,
 'University of Bologna': 99.0,
 'University of Bonn': 64.0,
 'University of Bordeaux': 99.0,
 'University of Bordeaux 1': nan,
 'University of Bradford': 420.0,
 'University of Bremen': 234.0,
 'University of Bristol': 57.0,
 'University of British Columbia': 28.0,
 'University of Buenos Aires': 216.0,
 'University of Cagliari': 169.0,
 'University of Calcutta': 490.0,
 'University of California, Berkeley': 9.0,
 'University of California, Davis': 13.0,
 'University of California, Irvine': 56.0,
 'University of California, Los Angeles': 4.0,
 'University of California, Riverside': 113.0,
 'University of California, San Diego': 25.0,
 'University of California, San Francisco': 8.0,
 'University of California, Santa Barbara': 26.0,
 'University of California, Santa Cruz': 61.0,
 'University of California-Berkeley': nan,
 'University of Cambridge': 1.0,
 'University of Campinas': 103.0,
 'University of Canterbury': 132.0,
 'University of Cape Town': 180.0,
 'University of Central Florida': 99.0,
 'University of Chicago': 2.0,
 'University of Chile': 299.0,
 'University of Cincinnati': 149.0,
 'University of Coimbra': 106.0,
 'University of Colorado Health Science Center': nan,
 'University of Colorado at Boulder': nan,
 'University of Colorado at Denver': nan,
 'University of Connecticut': 99.0,
 'University of Copenhagen': 47.0,
 'University of Delaware': 149.0,
 'University of Dortmund': nan,
 'University of Duesseldorf': nan,
 'University of Duisburg-Essen': 199.0,
 'University of Durham': nan,
 'University of East Anglia': 187.0,
 'University of Eastern Finland': 149.0,
 'University of Erlangen-Nuremberg': 177.0,
 'University of Essex': 331.0,
 'University of Exeter': 240.0,
 'University of Ferrara': 99.0,
 'University of Florence': 199.0,
 'University of Florida': 60.0,
 'University of Frankfurt': nan,
 'University of Freiburg': nan,
 'University of Fribourg': 372.0,
 'University of Geneva': 73.0,
 'University of Genoa': 99.0,
 'University of Genova': nan,
 'University of Giessen': nan,
 'University of Goettingen': nan,
 'University of Gothenburg': 86.0,
 'University of Granada': 299.0,
 'University of Graz': 183.0,
 'University of Greifswald': 484.0,
 'University of Groningen': 36.0,
 'University of Guelph': 199.0,
 'University of Haifa': 299.0,
 'University of Halle-Wittenberg': nan,
 'University of Hamburg': 99.0,
 'University of Hannover': nan,
 'University of Hawaii at Manoa': 337.0,
 'University of Heidelberg': nan,
 'University of Helsinki': 44.0,
 'University of Hertfordshire': 202.0,
 'University of Houston': 199.0,
 'University of Idaho': 254.0,
 'University of Illinois at Chicago': 99.0,
 'University of Illinois at Urbana-Champaign': nan,
 'University of Innsbruck': 149.0,
 'University of Iowa': 99.0,
 'University of Jena': 99.0,
 'University of Jyvaskyla': nan,
 'University of Kansas': 149.0,
 'University of Kansas - Lawrence': nan,
 'University of Kansas Medical Center': nan,
 'University of Karlsruhe': nan,
 'University of Kentucky': 149.0,
 'University of Kiel': 99.0,
 'University of Koeln': nan,
 'University of Konstanz': 325.0,
 'University of KwaZulu-Natal': 99.0,
 'University of Lausanne': 156.0,
 'University of Leeds': 60.0,
 'University of Leicester': 133.0,
 'University of Leipzig': nan,
 'University of Liege': nan,
 'University of Lille 1': nan,
 'University of Lisbon': 399.0,
 'University of Liverpool': 98.0,
 'University of Ljubljana': 399.0,
 'University of Lorraine': 184.0,
 'University of Louisville': 104.0,
 'University of Maastricht': nan,
 'University of Maine': nan,
 'University of Mainz': nan,
 'University of Malaya': 197.0,
 'University of Manitoba': 129.0,
 'University of Marburg': 145.0,
 'University of Maryland, Baltimore': 99.0,
 'University of Maryland, Baltimore County': 99.0,
 'University of Maryland, College Park': 74.0,
 'University of Massachusetts Amherst': 118.0,
 'University of Massachusetts Medical School - Worcester': nan,
 'University of Medicine and Dentistry New Jersey': nan,
 'University of Melbourne': 60.0,
 'University of Miami': 49.0,
 'University of Michigan - Ann Arbor': nan,
 'University of Michigan-Ann Arbor': nan,
 'University of Milan': 199.0,
 'University of Milan - Bicocca': 99.0,
 'University of Minnesota, Twin Cities': 18.0,
 'University of Mississippi': nan,
 'University of Missouri - Columbia': nan,
 'University of Montana - Missoula': 284.0,
 'University of Montpellier': 99.0,
 'University of Montpellier 2': 99.0,
 'University of Montreal': 50.0,
 'University of Muenster': nan,
 'University of Munich': nan,
 'University of Naples Federico II': 99.0,
 'University of Nebraska - Lincoln': nan,
 'University of Nebraska Medical Center': 99.0,
 'University of Nevada - Reno': nan,
 'University of New England': nan,
 'University of New Hampshire - Durham': nan,

# PUNTO 5: Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country

In [75]:
times_data['num_students1']=times_data['num_students'].str.extract(r'([0-9]*)')
times_data['num_students2']=times_data['num_students'].str.extract(r'([0-9]*$)')
times_data['f_m_ratio1']=times_data['female_male_ratio'].str.extract("(^[0-9]+)")
times_data['f_m_ratio2']=times_data['female_male_ratio'].str.extract(r'([0-9]+$)')
times_data.head()
times_data['num_students1']=np.array(times_data['num_students1'],dtype=float)
times_data['num_students2']=np.array(times_data['num_students2'],dtype=float)
times_data['f_m_ratio1']=np.array(times_data['f_m_ratio1'],dtype=float)
times_data['f_m_ratio2']=np.array(times_data['f_m_ratio2'],dtype=float)

In [76]:
times_data['num_students']=times_data['num_students1']*1000+times_data['num_students2']
times_data['female_male_ratio']=times_data['f_m_ratio1']/times_data['f_m_ratio2']
times_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,wrank_M,wrank_m,num_students1,num_students2,f_m_ratio1,f_m_ratio2
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,20152.0,8.9,25%,NaN,2011,1,1,20.0,152.0,NaN,NaN
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,2243.0,6.9,27%,0.492537,2011,2,2,2.0,243.0,33.0,67.0
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,11074.0,9.0,33%,0.587302,2011,3,3,11.0,74.0,37.0,63.0
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,15596.0,7.8,22%,0.724138,2011,4,4,15.0,596.0,42.0,58.0
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,7929.0,8.4,27%,0.818182,2011,5,5,7.0,929.0,45.0,55.0

In [77]:
MR_data=times_data.loc[times_data.groupby('university_name')['year'].idxmax()][['university_name','country','num_students','female_male_ratio','f_m_ratio1']]
MR_data['num_females']=MR_data['num_students']*(MR_data['f_m_ratio1']/100)
MR_data['num_males']=MR_data['num_students']-MR_data['num_females']
MR_data[['country','num_females','num_males']].groupby('country',as_index=False).sum()

                      country  num_females   num_males
0                   Argentina     67191.26    41181.74
1                   Australia    391735.88   321640.12
2                     Austria     68364.08    66112.92
3                  Bangladesh     21323.44    41392.56
4                     Belarus     20219.07     9083.93
..                        ...          ...         ...
67  Unisted States of America         0.00        0.00
68       United Arab Emirates      9516.44     4930.56
69             United Kingdom    711813.62   613028.38
70   United States of America   1601453.63  1556321.37
71              Unted Kingdom         0.00        0.00

[72 rows x 3 columns]

# PUNTO 6: Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

In [78]:
MR_data[MR_data['f_m_ratio1']<=(MR_data['f_m_ratio1'].mean())][['university_name','num_females']]

                               university_name  num_females
2003                        Aalborg University      8362.56
2056                          Aalto University      5151.68
2105                    Aberystwyth University      4440.96
2406                           Ajou University      4192.98
2408                     Alexandria University     58618.26
...                                        ...          ...
2104                       Zhejiang University     19478.28
1856                  École Normale Supérieure      1104.00
2013          École Normale Supérieure de Lyon      1086.82
1904                       École Polytechnique       437.22
1833  École Polytechnique Fédérale de Lausanne      2609.82

[284 rows x 2 columns]

# PUNTO 7:For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country)

In [79]:
MR_data1=MR_data[MR_data['f_m_ratio1']<=(MR_data['f_m_ratio1'].mean())][['country','num_students']]
MR_data2=MR_data1.groupby('country',as_index=False)['num_students'].sum()
MR_data3=pd.merge(MR_data2,MR_data[['country','num_students']].groupby('country',as_index=False).sum(),on='country')
MR_data3['ratio_students']=MR_data3['num_students_x']/MR_data3['num_students_y']
MR_data3[['country','ratio_students']]

                     country  ratio_students
0                  Australia        0.146438
1                    Austria        0.398633
2                 Bangladesh        1.000000
3                     Brazil        0.421244
4                     Canada        0.077765
5                      Chile        0.783885
6                      China        0.623643
7                   Colombia        0.288645
8             Czech Republic        0.190266
9                    Denmark        0.382933
10                     Egypt        0.955296
11                   Estonia        0.577928
12                   Finland        0.374775
13                    France        0.089205
14                   Germany        0.412312
15                     Ghana        1.000000
16                    Greece        0.283140
17                   Hungary        0.162328
18                     India        0.642430
19                      Iran        0.771843
20                    Israel        0.284451
21                     Italy        0.533777
22                     Japan        0.789005
23                     Kenya        1.000000
24                  Malaysia        0.100539
25                    Mexico        0.094595
26                   Morocco        1.000000
27               Netherlands        0.260686
28                   Nigeria        1.000000
29                    Norway        0.261207
30                  Pakistan        0.435989
31                    Poland        0.229180
32                  Portugal        0.186985
33       Republic of Ireland        0.231958
34        Russian Federation        0.557717
35                 Singapore        1.000000
36                  Slovakia        0.439926
37               South Korea        0.567687
38                     Spain        0.136446
39                    Sweden        0.110346
40               Switzerland        0.264946
41                    Taiwan        0.679579
42                  Thailand        0.254176
43                    Turkey        0.319877
44                   Ukraine        0.611548
45      United Arab Emirates        0.361736
46            United Kingdom        0.139364
47  United States of America        0.314326

# PUNTO 8:  Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [80]:
edAtt_data=pd.read_csv("Downloads/2020/educational_attainment_supplementary_data.csv")
ed_att_data=(edAtt_data.dropna(subset=['country_name'])).dropna(subset=['series_name'])
ed_att_data.tail()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
79045,Zimbabwe,UIS: Percentage of population age 25+ with som...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.84323,NaN,NaN
79046,Zimbabwe,UIS: Percentage of population age 25+ with som...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16.68491,NaN,NaN
79047,Zimbabwe,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11.99412,NaN,NaN
79048,Zimbabwe,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.77150,NaN,NaN
79049,Zimbabwe,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9.14588,NaN,NaN

# PUNTO 9:  From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [81]:
lista_dataframe=[]
for i in ed_att_data.index:
    L1=[ed_att_data['country_name'][i] for _ in range(27)]
    L2=[ed_att_data['series_name'][i] for _ in range(27)]
    L3=list(ed_att_data.columns[2:29])
    L4=list(ed_att_data.iloc[i][2:29])
    lista_dataframe.append(pd.DataFrame(zip(L1,L2,L3,L4), columns=['country_name','series_name','year','value']))
pd.concat(lista_dataframe)

,country_name,series_name,year,value
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.33000
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1986,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1987,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1990,0.44000
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1991,NaN
...,...,...,...,...
22,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2010,NaN
23,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2011,NaN
24,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2012,9.14588
25,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2013,NaN
26,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN

# PUNTO 10: For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking)

In [30]:
times_data['nome_università']=times_data['university_name']
rankTIMES=times_data.iloc[times_data.groupby('university_name')['year'].idxmax()][['nome_università','world_rank']]
shanghaiData['nome_università']=shanghaiData['university_name']
rankSHANGHAI=shanghaiData.iloc[shanghaiData.groupby('university_name')['year'].idxmax()][['nome_università','world_rank']]
cwurData['nome_università']=cwurData['institution']
rankCWUR=cwurData.iloc[cwurData.groupby('institution')['year'].idxmax()][['nome_università','world_rank']]
pd.concat([rankTIMES,rankSHANGHAI,rankCWUR]).groupby('nome_università',as_index=False).count()

                               nome_università  world_rank
0     AGH University of Science and Technology           2
1                           Aalborg University           3
2                             Aalto University           3
3                            Aarhus University           3
4                       Aberystwyth University           2
...                                        ...         ...
1447                    École centrale de Lyon           1
1448          École normale supérieure - Paris           1
1449        École normale supérieure de Cachan           1
1450          École normale supérieure de Lyon           1
1451                         Örebro University           2

[1452 rows x 2 columns]

# PUNTO 11: In the times ranking, compute the number of times each university appears

In [31]:
times_data.groupby('university_name',as_index=False).size()

                              university_name  size
0    AGH University of Science and Technology     1
1                          Aalborg University     5
2                            Aalto University     5
3                           Aarhus University     6
4                      Aberystwyth University     5
..                                        ...   ...
813                  École Normale Supérieure     6
814          École Normale Supérieure de Lyon     6
815                       École Polytechnique     6
816  École Polytechnique Fédérale de Lausanne     6
817                         Örebro University     1

[818 rows x 2 columns]

# PUNTO 12: Find the universities that appear at most twice in the times ranking

In [32]:
numero_app=times_data.groupby('university_name',as_index=False).size()
numero_app[numero_app['size']<=2]

                              university_name  size
0    AGH University of Science and Technology     1
5                  Adam Mickiewicz University     1
6                    Aix-Marseille University     1
7                             Ajou University     1
9              Alexandru Ioan Cuza University     1
..                                        ...   ...
806                  Yokohama City University     1
807              Yokohama National University     1
810                        Yuan Ze University     2
811               Yıldız Technical University     1
817                         Örebro University     1

[408 rows x 2 columns]

# PUNTO 13: The universities that, in any year, have the same position in all three rankings (they must have the same position in a year)

In [33]:
FUSO=pd.merge(shanghaiData,times_data,on='nome_università')
FUSO1=pd.merge(cwurData,FUSO,on='nome_università')
FUSO1.head()[['nome_università','world_rank','world_rank_x','world_rank_y']]
FUSO1['world_rank']=np.array(FUSO1['world_rank'],dtype=str)
FUSO1[['nome_università','world_rank','world_rank_x','world_rank_y']].head()

      nome_università world_rank world_rank_x world_rank_y
0  Harvard University          1            1            1
1  Harvard University          1            1            2
2  Harvard University          1            1            4
3  Harvard University          1            1            2
4  Harvard University          1            1            2

In [34]:
FUSO2=FUSO1[(FUSO1['world_rank']==FUSO1['world_rank_x'])&(FUSO1['world_rank_x']==FUSO1['world_rank_y'])]
FUSO2[['nome_università','world_rank','world_rank_x','world_rank_y']].tail()

               nome_università world_rank world_rank_x world_rank_y
2473     University of Chicago          9            9            9
2475     University of Chicago          9            9            9
2479     University of Chicago          9            9            9
2481     University of Chicago          9            9            9
3164  Johns Hopkins University         16           16           16

In [35]:
FUSO2.groupby('nome_università',as_index=False).count()['nome_università']

0          Harvard University
1    Johns Hopkins University
2        Princeton University
3         Stanford University
4     University of Cambridge
5       University of Chicago
6             Yale University
Name: nome_università, dtype: object